# Space Race Data Analysis

![Dataset Cover](./dataset-cover.jpg)

[All Space Missions from 1957 - LACLA3D on www.kaggle.com - Data Set Link](https://www.kaggle.com/datasets/agirlcoding/all-space-missions-from-1957)

https://www.kaggle.com/datasets/agirlcoding/all-space-missions-from-1957

## Setup

> Import Libraries

In [25]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

> Load the dataset

In [26]:
file_path = "Space_Corrected.csv"
space_data = pd.read_csv(file_path)

> First 5 Rows (Head)

In [27]:
space_data.head()

,#,Mission #,Company Name,Location,Datum,Detail,Status Rocket,Rocket,Status Mission
0,0,0,SpaceX,"LC-39A, Kennedy Space Center, Florida, USA","Fri Aug 07, 2020 05:12 UTC",Falcon 9 Block 5 | Starlink V1 L9 & BlackSky,StatusActive,50.0,Success
1,1,1,CASC,"Site 9401 (SLS-2), Jiuquan Satellite Launch Ce...","Thu Aug 06, 2020 04:01 UTC",Long March 2D | Gaofen-9 04 & Q-SAT,StatusActive,29.75,Success
2,2,2,SpaceX,"Pad A, Boca Chica, Texas, USA","Tue Aug 04, 2020 23:57 UTC",Starship Prototype | 150 Meter Hop,StatusActive,NaN,Success
3,3,3,Roscosmos,"Site 200/39, Baikonur Cosmodrome, Kazakhstan","Thu Jul 30, 2020 21:25 UTC",Proton-M/Briz-M | Ekspress-80 & Ekspress-103,StatusActive,65.0,Success
4,4,4,ULA,"SLC-41, Cape Canaveral AFS, Florida, USA","Thu Jul 30, 2020 11:50 UTC",Atlas V 541 | Perseverance,StatusActive,145.0,Success

> Last 5 Rows (Tail)

In [28]:
space_data.tail()

,#,Mission #,Company Name,Location,Datum,Detail,Status Rocket,Rocket,Status Mission
4319,4319,4319,US Navy,"LC-18A, Cape Canaveral AFS, Florida, USA","Wed Feb 05, 1958 07:33 UTC",Vanguard | Vanguard TV3BU,StatusRetired,NaN,Failure
4320,4320,4320,AMBA,"LC-26A, Cape Canaveral AFS, Florida, USA","Sat Feb 01, 1958 03:48 UTC",Juno I | Explorer 1,StatusRetired,NaN,Success
4321,4321,4321,US Navy,"LC-18A, Cape Canaveral AFS, Florida, USA","Fri Dec 06, 1957 16:44 UTC",Vanguard | Vanguard TV3,StatusRetired,NaN,Failure
4322,4322,4322,RVSN USSR,"Site 1/5, Baikonur Cosmodrome, Kazakhstan","Sun Nov 03, 1957 02:30 UTC",Sputnik 8K71PS | Sputnik-2,StatusRetired,NaN,Success
4323,4323,4323,RVSN USSR,"Site 1/5, Baikonur Cosmodrome, Kazakhstan","Fri Oct 04, 1957 19:28 UTC",Sputnik 8K71PS | Sputnik-1,StatusRetired,NaN,Success

> Sample 10 Rows

In [39]:
space_data.sample(10)

,#,Mission #,Company Name,Location,Datum,Detail,Status Rocket,Rocket,Status Mission
1138,1138,1138,Boeing,"SLC-17A, Cape Canaveral AFS, Florida, USA","Sat Jun 30, 2001 19:46 UTC",Delta II 7425-10C | WMAP,StatusRetired,NaN,Success
2414,2414,2414,Martin Marietta,"SLC-40, Cape Canaveral AFS, Florida, USA","Mon Mar 16, 1981 13:30 UTC",Titan III(23)C | DSP-9,StatusRetired,NaN,Success
3541,3541,3541,RVSN USSR,"Site 90/19, Baikonur Cosmodrome, Kazakhstan","Wed Aug 06, 1969 05:40 UTC",Tsyklon-2 | Cosmos 291,StatusRetired,NaN,Success
2417,2417,2417,RVSN USSR,"Site 90/19, Baikonur Cosmodrome, Kazakhstan","Thu Mar 05, 1981 18:09 UTC",Tsyklon-2 | Cosmos 1249,StatusRetired,NaN,Success
3705,3705,3705,RVSN USSR,"Site 90/19, Baikonur Cosmodrome, Kazakhstan","Wed Dec 27, 1967 11:28 UTC",Tsyklon-2A | Cosmos 198,StatusRetired,NaN,Success

> Statistics Summary

In [29]:
space_data.describe()

                 #    Mission #
count  4324.000000  4324.000000
mean   2161.500000  2161.500000
std    1248.375611  1248.375611
min       0.000000     0.000000
25%    1080.750000  1080.750000
50%    2161.500000  2161.500000
75%    3242.250000  3242.250000
max    4323.000000  4323.000000

> Data Types & Missing Values

In [30]:
space_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4324 entries, 0 to 4323
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   #               4324 non-null   int64
 1   Mission #       4324 non-null   int64
 2   Company Name    4324 non-null   object
 3   Location        4324 non-null   object
 4   Datum           4324 non-null   object
 5   Detail          4324 non-null   object
 6   Status Rocket   4324 non-null   object
 7   Rocket          964 non-null    object
 8   Status Mission  4324 non-null   object
dtypes: int64(2), object(7)
memory usage: 304.2+ KB

> Unique Values

In [31]:
space_data.nunique()

#                 4324
Mission #         4324
Company Name        56
Location           137
Datum             4319
Detail            4278
Status Rocket        2
Rocket              56
Status Mission       4
dtype: int64

> Column Names

In [32]:
space_data.columns

Index(['#', 'Mission #', 'Company Name', 'Location', 'Datum', 'Detail',
       'Status Rocket', 'Rocket', 'Status Mission'],
      dtype='object')

> Value Counts of Companies

In [33]:
space_data["Company Name"].value_counts()

Company Name
RVSN USSR           1777
Arianespace          279
CASC                 251
General Dynamics     251
NASA                 203
VKS RF               201
US Air Force         161
ULA                  140
Boeing               136
Martin Marietta      114
SpaceX               100
MHI                   84
Northrop              83
Lockheed              79
ISRO                  76
Roscosmos             55
ILS                   46
Sea Launch            36
ISAS                  30
Kosmotras             22
US Navy               17
ISA                   13
Rocket Lab            13
Eurockot              13
ESA                   13
Blue Origin           12
IAI                   11
ExPace                10
ASI                    9
CNES                   8
AMBA                   8
MITT                   7
JAXA                   7
Land Launch            7
UT                     5
KCST                   5
CASIC                  5
Exos                   4
CECLES                 4
Arm??e de l'Air        4
KARI                   3
SRC                    3
AEB                    3
RAE                    2
OKB-586                2
Yuzhmash               2
Landspace              1
Douglas                1
EER                    1
Starsem                1
Virgin Orbit           1
IRGC                   1
i-Space                1
OneSpace               1
Sandia                 1
Khrunichev             1
Name: count, dtype: int64

> Value Counts of Locations

In [34]:
space_data["Location"].value_counts()

Location
Site 31/6, Baikonur Cosmodrome, Kazakhstan               235
Site 132/1, Plesetsk Cosmodrome, Russia                  216
Site 43/4, Plesetsk Cosmodrome, Russia                   202
Site 41/1, Plesetsk Cosmodrome, Russia                   198
Site 1/5, Baikonur Cosmodrome, Kazakhstan                193
                                                        ...
Jiuquan Satellite Launch Center, China                     1
LP-41, Kauai, Pacific Missile Range Facility               1
Tai Rui Barge, Yellow Sea                                  1
Launch Plateform, Shahrud Missile Test Site                1
K-496 Submarine, Barents Sea Launch Area, Barents Sea      1
Name: count, Length: 137, dtype: int64

> Value Counts of Rockets

In [35]:
space_data["Rocket"].value_counts()

Rocket
450.0       136
200.0        75
40.0         55
62.0         41
30.8         38
109.0        37
50.0         34
64.68        34
29.75        33
90.0         32
41.8         31
48.5         26
29.15        25
31.0         22
29.0         22
59.0         22
69.7         17
21.0         16
65.0         16
35.0         16
56.5         15
37.0         15
164.0        15
7.5          14
1,160.0      13
47.0         13
25.0         12
350.0        11
153.0        11
45.0         10
112.5         9
5.3           9
123.0         8
145.0         7
85.0          7
120.0         7
80.0          7
115.0         6
59.5          5
7.0           5
46.0          5
136.6         4
63.23         4
140.0         3
133.0         3
190.0         3
130.0         3
135.0         2
5,000.0       2
39.0          2
55.0          1
15.0          1
20.14         1
20.0          1
12.0          1
28.3          1
Name: count, dtype: int64